<!DOCTYPE html>
<html>
  <meta charset="UTF-8">
<head>
<title>Grade</title>
<link rel="stylesheet" href="stylee.css" >
</head>
<body>
 
                      
                        <?php

$score1 = $_POST["score1"];
$score2 = $_POST['score2'];
$score3 = $_POST['score3'];
$score4 = $_POST['score4'];
$num = ($score1+$score2+$score3+$score4)/4;

if ($num > 4.00) {
   echo "คะแนนของคุณคือ $num <br>";
   echo " ผลสอบปรากฎว่า <h1> ระบบผิดพลาด กรุณากรอกเกรดให้ถูกต้อง</h1>";
   
} 
elseif ($score1 == 5) {
   echo " ผลสอบปรากฎว่า <h1> ระบบผิดพลาด กรุณากรอกเกรดให้ถูกต้อง</h1>";
}
elseif ($score2 == 5) {
   echo " ผลสอบปรากฎว่า <h1> ระบบผิดพลาด กรุณากรอกเกรดให้ถูกต้อง</h1>";
}
elseif ($score3 == 5) {
   echo " ผลสอบปรากฎว่า <h1> ระบบผิดพลาด กรุณากรอกเกรดให้ถูกต้อง</h1>";
}
elseif ($score4 == 5) {
   echo " ผลสอบปรากฎว่า <h1> ระบบผิดพลาด กรุณากรอกเกรดให้ถูกต้อง</h1>";
}
elseif ($num >= 2.75) {
   echo "<h3> เกรดเฉลี่ย 4 ภาคเรียนของคุณคือ เกรด $num  เก่งมาก คุณสามารถเข้าได้ทุกแผนการเรียน </h3>
  แผนการเรียนที่สามารถเข้าได้คือ : <br> แผนการเรียน วิทยาศาสตร์ คณิตศาสตร์ <br>
แผนการเรียน ภาษาอังกฤษ คณิตศาสตร์ <br>
แผนการเรียน ภาษาอังกฤษ ภาษาจีน<br>
แผนการเรียน ภาษาอังกฤษ ภาษาฝรั่งเศส<br>
แผนการเรียน ภาษาอังกฤษ ภาษาเกาหลี<br>
แผนการเรียน ภาษาไทย สังคมศึกษา<br>
แผนการเรียน พลศึกษา<br>
แผนการเรียนการงานอาชีพ ศิลปะ<br> ";
} elseif ($num >= 2.5){
   echo " <h3> เกรดเฉลี่ย 4 ภาคเรียนของคุณคือ เกรด $num </h3>
  แผนการเรียนที่สามารถเข้าได้คือ : <br>
แผนการเรียน ภาษาอังกฤษ คณิตศาสตร์ <br>
แผนการเรียน ภาษาอังกฤษ ภาษาจีน<br>
แผนการเรียน ภาษาอังกฤษ ภาษาฝรั่งเศส<br>
แผนการเรียน ภาษาอังกฤษ ภาษาเกาหลี<br>
แผนการเรียน ภาษาไทย สังคมศึกษา<br>
แผนการเรียน พลศึกษา<br>
แผนการเรียนการงานอาชีพ ศิลปะ<br> 
หากต้องการเข้าห้องวิทย์คณิต คุณต้องทำเกรดเฉลี่ย ม.3 ภาคเรียนที่ 1 ให้ได้ 3.75-4.00
<br>หรือคุณสามารถสอบเข้าได้นะ พวกเราเป็นกำลังใจให้นะ:) เราเชื่อว่าคุณทำได้!!
";
} elseif ($num >= 2.437) {
   echo " <h3> เกรดเฉลี่ย 4 ภาคเรียนของคุณคือ เกรด $num </h3>
  แผนการเรียนที่สามารถเข้าได้คือ : <br>
แผนการเรียน ภาษาอังกฤษ ภาษาจีน<br>
แผนการเรียน ภาษาอังกฤษ ภาษาฝรั่งเศส<br>
แผนการเรียน ภาษาอังกฤษ ภาษาเกาหลี<br>
แผนการเรียน ภาษาไทย สังคมศึกษา<br>
แผนการเรียน พลศึกษา<br>
แผนการเรียนการงานอาชีพ ศิลปะ<br>
หากต้องการเข้าห้องวิทย์คณิต คุณต้องทำเกรดเฉลี่ย ม.3 ภาคเรียนที่ 1 ให้ได้ 4.00
<br>หากต้องการเข้าห้องภาษาอังกฤษ-คณิตศาสตร์ คุณต้องทำเกรดเฉลี่ย ม.3 ภาคเรียนที่ 1 ให้ได้ 3.50-4.00
<br>หรือคุณสามารถสอบเข้าได้นะ พวกเราเป็นกำลังใจให้นะ:) เราเชื่อว่าคุณทำได้!!
";

} elseif ($num >= 2.25) {
   echo " <h3> เกรดเฉลี่ย 4 ภาคเรียนของคุณคือ เกรด $num </h3>
  แผนการเรียนที่สามารถเข้าได้คือ : <br>
แผนการเรียน ภาษาอังกฤษ ภาษาจีน<br>
แผนการเรียน ภาษาอังกฤษ ภาษาฝรั่งเศส<br>
แผนการเรียน ภาษาอังกฤษ ภาษาเกาหลี<br>
แผนการเรียน ภาษาไทย สังคมศึกษา<br>
แผนการเรียน พลศึกษา<br>
แผนการเรียนการงานอาชีพ ศิลปะ<br>
หากต้องการเข้าห้องวิทย์คณิต คุณต้องสอบเข้า
<br>หากต้องการเข้าห้องภาษาอังกฤษ-คณิตศาสตร์ คุณต้องทำเกรดเฉลี่ย ม.3 ภาคเรียนที่ 1 ให้ได้ 3.50-4.00
<br>หรือคุณสามารถสอบเข้าได้นะ พวกเราเป็นกำลังใจให้นะ:) เราเชื่อว่าคุณทำได้!!
";

} elseif ($num >= 2.125) {
   echo " <h3> เกรดเฉลี่ย 4 ภาคเรียนของคุณคือ เกรด $num </h3>
  แผนการเรียนที่สามารถเข้าได้คือ : <br>
แผนการเรียน ภาษาอังกฤษ ภาษาจีน<br>
แผนการเรียน ภาษาอังกฤษ ภาษาฝรั่งเศส<br>
แผนการเรียน ภาษาอังกฤษ ภาษาเกาหลี<br>
แผนการเรียนการงานอาชีพ ศิลปะ<br> 
หากต้องการเข้าห้องวิทย์คณิต คุณต้องสอบเข้า
<br>หากต้องการเข้าห้องภาษาอังกฤษ-คณิตศาสตร์ คุณต้องทำเกรดเฉลี่ย ม.3 ภาคเรียนที่ 1 ให้ได้ 4.00
<br>หากต้องการเข้าห้องภาษาไทย สังคมศึกษา คุณต้องทำเกรดเฉลี่ย ม.3 ภาคเรียนที่ 1 ให้ได้ 2.75-4.00
<br>หากต้องการเข้าห้องพลศึกษา คุณต้องทำเกรดเฉลี่ย ม.3 ภาคเรียนที่ 1 ให้ได้ 2.75-4.00
<br>หรือคุณสามารถสอบเข้าได้นะ พวกเราเป็นกำลังใจให้นะ:) เราเชื่อว่าคุณทำได้!!
";
} elseif ($num >= 2) {
   echo " <h3> เกรดเฉลี่ย 4 ภาคเรียนของคุณคือ เกรด $num </h3>
  แผนการเรียนที่สามารถเข้าได้คือ : <br>
แผนการเรียน ภาษาอังกฤษ ภาษาจีน<br>
แผนการเรียน ภาษาอังกฤษ ภาษาฝรั่งเศส<br>
แผนการเรียน ภาษาอังกฤษ ภาษาเกาหลี<br>
แผนการเรียนการงานอาชีพ ศิลปะ<br> 
หากต้องการเข้าห้องวิทย์คณิต คุณต้องสอบเข้า
<br>หากต้องการเข้าห้องภาษาอังกฤษ-คณิตศาสตร์ คุณต้องสอบเข้า
<br>หากต้องการเข้าห้องภาษาไทย สังคมศึกษา คุณต้องทำเกรดเฉลี่ย ม.3 ภาคเรียนที่ 1 ให้ได้ 3.25-4.00
<br>หากต้องการเข้าห้องพลศึกษา คุณต้องทำเกรดเฉลี่ย ม.3 ภาคเรียนที่ 1 ให้ได้ 3.25-4.00
<br>หรือคุณสามารถสอบเข้าได้นะ พวกเราเป็นกำลังใจให้นะ:) เราเชื่อว่าคุณทำได้!!
";
} elseif ($num >= 0) {
   echo " <h3> เกรดเฉลี่ย 4 ภาคเรียนของคุณคือ เกรด $num </h3>
   แผนการเรียนที่สามารถเข้าได้คือ : คุณไม่มีแผนการเรียนที่สามารถเข้าได้ <br>
   แต่คุณสามารถสอบเข้าได้นะ พวกเราเป็นกำลังใจให้นะ:) เราเชื่อว่าคุณทำได้

   <br>";
} else {
    echo " <h3> เกรดเฉลี่ย 4 ภาคเรียนของคุณคือ เกรด $num </h3>
   แผนการเรียนที่สามารถเข้าได้คือ : คุณไม่มีแผนการเรียนที่สามารถเข้าได้ <br>
   แต่คุณสามารถสอบเข้าได้นะ พวกเราเป็นกำลังใจให้นะ:) เราเชื่อว่าคุณทำได้
   <br>";
}


?>
            
              
                  </td>
                </tr>
               </form>
              </table>
          
  
   
</body>
</html>